martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
char estadoPin = 0;
bool flagCheckArgs = 0;
String ultimoDirExplorado = {};

int pinLED = 15;

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void setup(void){
  
  	Serial.begin(115200);

	//initSPIFFS();
	pinMode(16, OUTPUT);
	pinMode(pinLED, OUTPUT);
	
	//File root;
  	int cuenta = 0;

      // Nos conectamos a nuestra red Wifi
	Serial.println();
	Serial.print("Conectando a ssid: ");
	Serial.println(ssid_1);

	
	WiFi.begin(ssid_1, password_1);

	while ((WiFi.status() != WL_CONNECTED) && cuenta < 20) {//límite de 20 intentos de 500 ms
		delay(500);
		Serial.print(".");
		cuenta++;
	
	}
	if(WiFi.status() != WL_CONNECTED){//si no logró conectarse
	
		Serial.println("No es posible conectar a WiFi");
		Serial.println("Se cambia a MODO LOCAL");


	}else{//si logró conectarse

		Serial.println("");
		Serial.println("Conectado a red WiFi!");
		Serial.println("Dirección IP: ");
		Serial.println(WiFi.localIP());
		
		//delay(5000);
		
		
	}
	/*
	//************************CONFIG MULTIWIFI***************************************

		if (!WiFi.config(local_IP, gateway, subnet, dns)) { //WiFi.config(ip, gateway, subnet, dns1, dns2);
			Serial.println("WiFi STATION Failed to configure Correctly"); 
		} 
		wifiMulti.addAP(ssid_1, password_1);  // add Wi-Fi networks you want to connect to, it connects strongest to weakest
		wifiMulti.addAP(ssid_2, password_2);  // Adjust the values in the Network tab
		wifiMulti.addAP(ssid_3, password_3);
		wifiMulti.addAP(ssid_4, password_4);  // You don't need 4 entries, this is for example!
		
		Serial.println("Connecting ...");
		while (wifiMulti.run() != WL_CONNECTED) { // Wait for the Wi-Fi to connect: scan for Wi-Fi networks, and connect to the strongest of the networks above
			delay(250); Serial.print('.');
		}
	*/
	Serial.println("\nConnected to "+WiFi.SSID()+" Use IP address: "+WiFi.localIP().toString()); // Report which SSID and IP is in use
	// The logical name http://fileserver.local will also access the device if you have 'Bonjour' running or your system supports multicast dns
	if (!MDNS.begin(servername)) {          // Set your preferred server name, if you use "myserver" the address would be http://myserver.local/
		Serial.println(F("Error setting up MDNS responder!")); 
		ESP.restart(); 
	} 
	#ifdef ESP32
	// Note: SD_Card readers on the ESP32 will NOT work unless there is a pull-up on MISO, either do this or wire one on (1K to 4K7)
		//Serial.println(MISO);
		pinMode(19,INPUT_PULLUP);
	#endif

	SPI.begin(SCK, MISO, MOSI, SD_CS_pin);

	Serial.print(F("Initializing SD card...")); 

	SD.begin(SD_CS_pin);//prueba
	//if (!SD.begin(SD_CS_pin)) { // see if the card is present and can be initialised. Wemos SD-Card CS uses D8 
	//if (!SD.begin(SD_CS_pin, SPI, 20000000 )) { // see if the card is present and can be initialised. Wemos SD-Card CS uses D8 
	//if (!SD.begin(SD_CS_pin, SPI, 80000000, "/sd", (uint8_t)5, false )) { // see if the card is present and can be initialised. Wemos SD-Card CS uses D8 
	if (!sd.begin(SD_CS_pin, SD_SCK_MHZ(20))) { // see if the card is present and can be initialised. Wemos SD-Card CS uses D8 
		Serial.println(F("Card failed or not present, no SD Card data logging possible..."));
		SD_present = false; 
	} 
	else
	{
		Serial.println(F("Card initialised... file access enabled..."));
		SD_present = true; 
	}

	// Note: Using the ESP32 and SD_Card readers requires a 1K to 4K7 pull-up to 3v3 on the MISO line, otherwise they do-not function.
	//----------------------------------------------------------------------   
	///////////////////////////// Server Commands 

	server.on("/", HomePage);
	server.on("/download", File_Download);
	//server.on("/upload",   File_Upload);
	//server.on("/fupload",  HTTP_POST,[](){ server.send(200);}, handleFileUpload);
	//server.on("/stream",   File_Stream);
	server.on("/delete",   File_Delete);
	server.on("/dir",      listar_SD_dir);
	server.on("/consultarPorFecha", ConsultarPorFecha);
	server.on("/login", mostrarLogin);
	server.on("/logout", mostrarLogout);
	server.on("/menu", mostrarMenu);

  ///////////////////////////// End of Request commands
  	server.begin();
	//client = server.client();
  	Serial.println("HTTP server started");


	// //******************** NESTOR ********************

	// pinMode(LED_BUILTIN, OUTPUT);
	// pinMode(pulsadorInicio, INPUT);
	// pinMode(activarElectrovalvula, OUTPUT);
	// pinMode(pulsadorCalibracion, INPUT);

	// boolean calibracion;
	// boolean memoriaSDinicializada = false;
	// //********************************************

	// // initializar the LCD
	// lcd.begin(20,4);
	// // Turn on the blacklight and print a message.
	// lcd.backlight();
	// lcd.print("INTI CAUCHOS");
	// memoriaSDinicializada = tarjetaSD1.inicializarSD();
	// //  if (!SD.begin(CS)) {
	// if(!memoriaSDinicializada){
	// 	Serial.println("inicialización fallida!"); 
	// 	lcd.setCursor(0, 0);
	// 	lcd.print("SD NO encontrada");
	// //while(!SD.begin(CS)){
	// while(!memoriaSDinicializada){
	// 	digitalWrite(LED_BUILTIN, HIGH);   // turn the LED on (HIGH is the voltage level)
	// 	lcd.backlight();
	// 	delay(500);                       // wait for a half second
	// 	digitalWrite(LED_BUILTIN, LOW);    // turn the LED off by making the voltage LOW
	// 	lcd.noBacklight();
	// 	delay(500);                       // wait for a half second
	// 	memoriaSDinicializada = tarjetaSD1.inicializarSD();
	// }
	
	// lcd.backlight();
	// lcd.clear();

	// } 
	// // **********************************************************************
	// if (! rtc.begin()) {
	// 	//   Serial.println("Couldn't find RTC");
	// 	while (1);
	// }

	// if (rtc.lostPower()) {
	// 	//    Serial.println("RTC lost power, lets set the time!");
	// }
	// //**********************************************************************
	// dht.begin();    //Inicializar sensor de temperatura
	// EEPROM.begin(EEPROM_SIZE);
	
	// imprimirLCDfijo("Pulse INICIO",0, 0);
	// imprimirLCDfijo("para comenzar",0, 1);



}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void loop(void){
	server.handleClient(); // Listen for client connections
	
