martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
	/*
	Serial.print("cuenta: ");
	Serial.println(cuenta);
	cuenta++;
	delay(3000);
	*/
	//server.addHandler();
/*
	//  boolean tiempoCumplido;
	boolean calibracion;
	//  String inicio = "";           //Cuando se inicia la placa Impacto envía al inicio de la comunicación "ini")
	String nombreArchivo = "";
	boolean estadoPulsadorInicio;


	while (Serial.available() > 0) {    // Es para lectura del puerto serie
		leerSerie();
	}
	calibracion = digitalRead(pulsadorCalibracion);
	if(!calibracion)  calibracionSensoresPresion();
        
	estadoPulsadorInicio = digitalRead(pulsadorInicio);
	
	if(estadoPulsadorInicio == LOW){
		nombreArchivo = rutinaInicioEnsayo();
   		rutinaEnsayo(nombreArchivo);
   }
  */     

	
	boolean estadoPulsadorInicio;

	estadoPulsadorInicio = digitalRead(21);

	if(estadoPulsadorInicio == LOW && flagWebserverLibre){//chequea que no se esté accediendo a la memoria SD desde el webserver
	
		flagWebserverLibre = 0;//se ocupa el webserver
		Serial.println("NO se puede acceder a la memoria SD desde el webserver");
		toggleLED10veces();
		flagWebserverLibre = 1;//se libera el webserver
		Serial.println("SI se puede acceder a la memoria SD desde el webserver");
	
	}


}

// All supporting functions from here...
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

void HomePage(){

	//SendHTML_Header();
/*
	if (server.hasArg("user") && server.hasArg("pass")){//si se cambia el login
		usernameLogin = server.arg(0);//captura el username
		passwordLogin = server.arg(1);//captura el password
		
		//validación de credenciales de acceso
		if(usernameLogin == usernameLoginEnabled1 && passwordLogin == passwordLoginEnabled1){
			//flagUsuarioHabilitado = 1;
			flagUsuarioLogueado = 1;
			//flagWebserverLibre = 0;//si coinciden las credenciales, el webserver queda en estado Ocupado
			

		}else{

			//flagUsuarioHabilitado = 0;
			flagUsuarioLogueado = 0;
			
		}
*/

	//client = server.client();

	//chequeoIP();
	


/*

	//clienteEntrante = client.remoteIP().toString();//cuando se conecta un nuevo cliente al HomePage, guarda la IP
	clienteEntrante = server.client().remoteIP().toString();//cuando se conecta un nuevo cliente al HomePage, guarda la IP
	Serial.println("la IP entrante es: ");
	Serial.println(clienteEntrante);

	if(flagUsuarioLogueado == 0){//si viene del logout, solo debe ofrecer login

		flagClienteNuevo = 1;//solo debe ofrecer login
		Serial.println("Viene del logout");
		
		append_page_header();
		webpage += ("<p>Viene del logout. Debe loguearse para navegar</p>");
		webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled ></form>");

	
	
	
	
	
	}else{//si clienteActual ya tiene una IP, si hay usuarioLogueado

	Serial.print("clienteEntrante: ");
	Serial.println(clienteEntrante);
	Serial.print("clienteActual: ");
	Serial.println(clienteActual);

		//detección de clienteEntrante por primera vez (distinto de 0.0.0.0)
		if(clienteEntrante != clienteActual){//Si la IP entrante es distinta de la actual, es un cliente nuevo

			flagClienteNuevo = 1;//no debe ofrece nada, no puede navegar
			Serial.println("clienteEntrante distinto del actual");
			Serial.println("NUEVA IP: ");
			Serial.println(clienteEntrante);
			
			append_page_header();
			webpage += ("<p>clienteEntrante distinto del actual. Debe solicitar el deslogueo o esperar timeout</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled ></form>");

		}else{//si es la misma IP

			flagClienteNuevo = 0;//solo debe ofrecer logout 
			Serial.println("clienteEntrante es igual al actual: ofrece logout y permite navegación");
			
			append_page_header();
			webpage += ("<p>clienteEntrante igual al actual (misma IP)</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");
			

		}



	}
*/

	//append_page_header();

	if (server.hasArg("logout") || server.hasArg("reintentar")){//si se desloguea

		Serial.print("Llegó argumento Logout");
		flagUsuarioLogueado = 0;
		flagClienteNuevo = 0;
		usernameLogin = "";
	
	}

	Serial.print("HOME -- flagUsuarioLogueado: ");
	Serial.println(flagUsuarioLogueado);

	

	if(flagUsuarioLogueado == 1){//si ya hay un usuario logueado no muestra el login

		Serial.println("Ya existe un usuario logueado");
		chequeoIP();

	}else{//si no hay usuario logueado, muestra el login
		
		Serial.println("No existe un usuario logueado");
		append_page_header();
		webpage += F("<h2>Login</h2>");
  		webpage += F("<form action='/menu' method='post'><label for='user'><b>Username: </b></label><input type='text' name='user' id='user' value=''><label for='pass'><b>Password: </b></label><input type='text' name='pass' id='pass' value=''><input type='Submit' value='Login'></form>");

	}
	
	
	pathDirectory = "/";//resetea el pathDirectory para realizar una nueva navegación
	

	



	append_page_footer();
	SendHTML_Content();
	SendHTML_Stop(); // Stop is needed because no content length was sent
/*
	

	

	//client = server.client();
	//cliente = client.remoteIP().toString();

	//if(cliente)
	//Serial.println(cliente);
	//Serial.println(client.remoteIP());
	
	

	
	if(flagUsuarioLogueado == 0){

		if (server.hasArg("user") && server.hasArg("pass")){//si se cambia el login
		usernameLogin = server.arg(0);//captura el username
		passwordLogin = server.arg(1);//captura el password
		
		//webpage += ("<p> Usuario logueado: " + usernameLogin + " Password: " + passwordLogin + "</p>");
		

			//validación de credenciales de acceso
			if(usernameLogin == usernameLoginEnabled1 && passwordLogin == passwordLoginEnabled1){
				//flagUsuarioHabilitado = 1;
				flagUsuarioLogueado = 1;
				//flagWebserverLibre = 0;//si coinciden las credenciales, el webserver queda en estado Ocupado
				append_page_header();
				webpage += ("<p>Usuario habilitado</p>");
				webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");

			}else{

