martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
//******************************************************************************************
void leerSerie(){
  String comando = "";
  String dateTime = "";
  String nombreArchivo = "";
  String ano, mes, dia, hora, minutos, segundos;
  String directorio = "";
  int anoInt, mesInt, diaInt, horaInt, minutosInt, segundosInt;
  char dateTimeChar[22];
        
  comando = Serial.readStringUntil(':');
  if(comando == "setRTC"){              //Si recibe este String seguido por ":" por puerto serie seteará el RTC con la siguiente cadena año mes dia hora minutos segundos
    dateTime = Serial.readString();     // Ej.:Comando por puero serie: setRTC:20210213163218  -> año:2021, mes: 02, día: 13, hora: 16, minutos: 32, segundos: 18
    ano = dateTime.substring(0,4);
    mes = dateTime.substring(4,6);
    dia = dateTime.substring(6,8);
    hora = dateTime.substring(8,10);
    minutos = dateTime.substring(10,12);
    segundos = dateTime.substring(12,14);

    anoInt = ano.toInt();
    mesInt = mes.toInt();
    diaInt = dia.toInt();
    horaInt = hora.toInt();
    minutosInt = minutos.toInt();
    segundosInt = segundos.toInt();
    rtc.adjust(DateTime(anoInt, mesInt, diaInt, horaInt , minutosInt, segundosInt));
    DateTime now = rtc.now();
    sprintf(dateTimeChar, "%02d/%02d/%02d %02d:%02d:%02d", now.year(), now.month(),now.day(),  now.hour(), now.minute(), now.second()); 
    Serial.println("Fecha y hora modificadas: ");
    Serial.print(dateTimeChar);

  }
  if(comando == "leerDir"){
      tarjetaSD1.listDir(SD, "/", 0);
  }  
 if(comando == "leerSubDir"){
      directorio += "/";
      directorio += Serial.readString(); 
      tarjetaSD1.listSubDir(SD, directorio.c_str(), 0);
  }  
    if(comando == "leerArchivo"){
      nombreArchivo = "/";
      nombreArchivo += Serial.readString();
      tarjetaSD1.leerFile(SD, nombreArchivo.c_str());
  }  
}

void agregaFilaEnTabla(String nombreDeArchivo, String fechaNormalizada, String rutaDeArchivo){

	webpage += "<tr><td>"+ String(nombreDeArchivo) +"</td><td>"+fechaNormalizada+"</td>";
	webpage += "<td>"+String(entry.isDirectory()?"Dir":"File")+"</td>";
	int bytes = entry.size();
	String fsize = "";
	
	if (bytes < 1024)                     fsize = String(bytes)+" B";
	else if(bytes < (1024 * 1024))        fsize = String(bytes/1024.0,3)+" KB";
	else if(bytes < (1024 * 1024 * 1024)) fsize = String(bytes/1024.0/1024.0,3)+" MB";
	else                                  fsize = String(bytes/1024.0/1024.0/1024.0,3)+" GB";

	webpage += "<td>"+fsize+"</td><td><form action='/delete' method='post'><input type='text' hidden name='lname' value='"+String(rutaDeArchivo)+"'><input type='submit' name='delete' value='Borrar'></form></td>";
	Serial.print("		Archivo a descargar = ");
	Serial.print(rutaDeArchivo);
	webpage += "<td><form action='/download' method='post'><input type='text' hidden name='lname' value='"+String(rutaDeArchivo)+"'><input type='submit' name='download' value='Descargar'></form></td>";
	Serial.print("\t");
	Serial.println(String(fsize));

}



String obtenerFechaDeArchivo(void){


	int indexBeginDate = 0;
	int indexEndDate = 0;

	int indexBeginYear = 0;
	int indexEndYear = 0;

	int indexBeginMonth = 0;
	int indexEndMonth = 0;

	int indexBeginDay = 0;
	int indexEndDay = 0;

	String date = {};
	String year = {};
	String month = {};
	String day = {};
	String fecha = {};


	//********FECHA******
	indexBeginDate = 0;
	indexEndDate =	filename.indexOf('T');

	date = filename.substring(indexBeginDate,indexEndDate);//obtiene la fecha del ensayo
	//Serial.println("Fecha: ");
	//Serial.println(date);

	//********AÑO******
	indexBeginYear = 0;
	indexEndYear =	3;

	year = filename.substring(indexBeginYear,indexEndYear + 1);//obtiene el año del ensayo
	//Serial.println("Año: ");
	//Serial.println(year);

	//********MES******
	indexBeginMonth = 4;
	indexEndMonth =	5;

	month = filename.substring(indexBeginMonth,indexEndMonth + 1);//obtiene el mes del ensayo
	//Serial.println("Mes: ");
	//Serial.println(month);

	//********DIA******
	indexBeginDay = 6;
	indexEndDay =	7;

	day = filename.substring(indexBeginDay,indexEndDay + 1);//obtiene el día del ensayo
	//Serial.println("Día: ");
	//Serial.println(day);

	fecha = year + "-" + month + "-" + day;
	
	return fecha;

}

/*
void mostrarLogin(void){

	
	
	//append_page_header();
	chequeoIP();
	
	webpage += F("<h2>Login</h2>");
  	webpage += F("<form action='/login' method='post'><label for='user'><b>Username: </b></label><input type='text' name='user' id='user' value=''><label for='pass'><b>Password: </b></label><input type='text' name='pass' id='pass' value=''><input type='Submit' value='Aceptar'></form>");
	
	pathDirectory = "/";//resetea el pathDirectory para realizar una nueva navegación
	

	if (server.hasArg("user") && server.hasArg("pass")){//si se cambia el login
		usernameLogin = server.arg(0);//captura el username
		passwordLogin = server.arg(1);//captura el password
		webpage += ("<p> Usuario logueado: " + usernameLogin + " Password: " + passwordLogin + "</p>");
		

		//validación de credenciales de acceso
		if(usernameLogin == usernameLoginEnabled1 && passwordLogin == passwordLoginEnabled1){
			//flagUsuarioHabilitado = 1;
			flagUsuarioLogueado = 1;
			flagWebserverLibre = 0;//si coinciden las credenciales, el webserver queda en estado Ocupado
			//clienteActual = client.remoteIP().toString();
			clienteActual = clienteEntrante;
			webpage += ("<p>Usuario habilitado</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");

		}else{
			//flagUsuarioHabilitado = 0;
			
			webpage += ("<p>Usuario incorrecto</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled></form>");
		}
	}else{

			//append_page_header();
			webpage += F("<p>Debe loguearse</p>");

	}
		
	append_page_footer();
	server.send(200,"text/html",webpage);

