martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
}
*/

void mostrarLogin(void){

	
	
	//append_page_header();
	chequeoIP();
	
	webpage += F("<h2>Login</h2>");
  	webpage += F("<form action='/login' method='post'><label for='user'><b>Username: </b></label><input type='text' name='user' id='user' value=''><label for='pass'><b>Password: </b></label><input type='text' name='pass' id='pass' value=''><input type='Submit' value='Aceptar'></form>");
	
	pathDirectory = "/";//resetea el pathDirectory para realizar una nueva navegación
	

	if (server.hasArg("user") && server.hasArg("pass")){//si se cambia el login
		usernameLogin = server.arg(0);//captura el username
		passwordLogin = server.arg(1);//captura el password
		webpage += ("<p> Usuario logueado: " + usernameLogin + " Password: " + passwordLogin + "</p>");
		

		//validación de credenciales de acceso
		if(usernameLogin == usernameLoginEnabled1 && passwordLogin == passwordLoginEnabled1){
			//flagUsuarioHabilitado = 1;
			flagUsuarioLogueado = 1;
			flagWebserverLibre = 0;//si coinciden las credenciales, el webserver queda en estado Ocupado
			//clienteActual = client.remoteIP().toString();
			clienteActual = clienteEntrante;
			webpage += ("<p>Usuario habilitado</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");

		}else{
			//flagUsuarioHabilitado = 0;
			
			webpage += ("<p>Usuario incorrecto</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled></form>");
		}
	}else{

			//append_page_header();
			webpage += F("<p>Debe loguearse</p>");

	}
		
	append_page_footer();
	server.send(200,"text/html",webpage);

}


void mostrarLogout(void){

	//flagUsuarioHabilitado = 0;
	//flagWebserverLibre = 1;
	flagUsuarioLogueado = 0;
	flagClienteNuevo = 0;
	usernameLogin = "";
	passwordLogin = "";
	clienteActual = "0.0.0.0";
	
	append_page_header();
	
	webpage += ("<h2>Logout (usuario deslogueago)</h2>");
	webpage += ("<p>Para usar el sistema debe loguearse</p>");
  	

		
	append_page_footer();
	server.send(200,"text/html",webpage);

}

void mostrarMenu(void){

	//flagUsuarioHabilitado = 0;
	//flagWebserverLibre = 1;
	//flagUsuarioLogueado = 0;
	//usernameLogin = "";
	//passwordLogin = "";
	//clienteActual = "0.0.0.0";
		

	

	//append_page_header();





	
	
	//webpage += ("<p>Para usar el sistema debe loguearse</p>");
  	


	if (server.hasArg("user") && server.hasArg("pass")){//si se cambia el login
		usernameLogin = server.arg(0);//captura el username
		passwordLogin = server.arg(1);//captura el password
		//webpage += ("<p> Usuario logueado: " + usernameLogin + " Password: " + passwordLogin + "</p>");
		

		//validación de credenciales de acceso
		if(usernameLogin == usernameLoginEnabled1 && passwordLogin == passwordLoginEnabled1){
			//flagUsuarioHabilitado = 1;
			flagUsuarioLogueado = 1;
			Serial.print("MENU -- flagUsuarioLogueado: ");
			Serial.print(flagUsuarioLogueado);
			//flagWebserverLibre = 0;//si coinciden las credenciales, el webserver queda en estado Ocupado
			//clienteActual = client.remoteIP().toString();
			//chequeoIP();
			append_page_header();
			clienteEntrante = server.client().remoteIP().toString();//cuando se conecta un nuevo cliente al HomePage, guarda la IP
			clienteActual = clienteEntrante;
			webpage += ("<h2>Menu</h2>");
			webpage += ("<p>Usuario habilitado</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");
			//webpage += ("<form action='/' method='post'><input type='hidden' name='logout' id='root' value='logout'><input type='Submit' value='Logout'></form>");

		}else{
			//flagUsuarioHabilitado = 0;
			flagUsuarioLogueado = 0;
			usernameLogin = "";//blanqueo de credenciales
			passwordLogin = "";//blanqueo de credenciales
			Serial.println("No coinciden las credenciales. Usuario incorrecto");
			chequeoIP();
			
			webpage += ("<h2>Menu</h2>");
			webpage += ("<p>Usuario incorrecto</p>");
			//webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled></form>");
			webpage += ("<form action='/' method='post'><input type='hidden' name='reintentar' id='root' value='reintentar'><input type='Submit' value='Reintentar'></form>");
			
		}
	}else{

			//append_page_header();
			webpage += F("<p>Debe loguearse</p>");

	}


		
	append_page_footer();
	server.send(200,"text/html",webpage);

}

void toggleLED10veces(void){

	

	for(int i = 0; i < 10; i++){
	
		Serial.println("pin Alto");
		digitalWrite(pinLED, HIGH);
		delay(1000);
		Serial.println("pin Bajo");
		digitalWrite(pinLED, LOW);
		delay(1000);
	
	}
	

}

void chequeoIP(void){


	
	clienteEntrante = server.client().remoteIP().toString();//cuando se conecta un nuevo cliente al HomePage, guarda la IP
	Serial.println("la IP entrante es: ");
	Serial.println(clienteEntrante);

	//append_page_header();

	if(flagUsuarioLogueado == 0){//si viene del logout, solo debe ofrecer login

		flagClienteNuevo = 1;//solo debe ofrecer login
		Serial.println("Viene del logout");
		
		append_page_header();
		//webpage += ("<p>Viene del logout. Debe loguearse para navegar</p>");
		//webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled ></form>");

	
	
	
	
	
	}else{//si clienteActual ya tiene una IP, si hay usuarioLogueado

		Serial.print("clienteEntrante: ");
		Serial.println(clienteEntrante);
		Serial.print("clienteActual: ");
		Serial.println(clienteActual);

		//detección de clienteEntrante por primera vez (distinto de 0.0.0.0)
		if(clienteEntrante != clienteActual && clienteActual != "0.0.0.0"){//Si la IP entrante es distinta de la actual, es un cliente nuevo

			flagClienteNuevo = 1;//no debe ofrece nada, no puede navegar
			Serial.println("clienteEntrante distinto del actual");
			Serial.println("NUEVA IP: ");
			Serial.println(clienteEntrante);
			
			append_page_header();
			webpage += ("<p>clienteEntrante distinto del actual. Debe solicitar el deslogueo o esperar timeout</p>");
			//webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled ></form>");

		}else{//si es la misma IP

			flagClienteNuevo = 0;//solo debe ofrecer logout 
			Serial.println("clienteEntrante es igual al actual: ofrece logout y permite navegación");
			
			append_page_header();
			webpage += ("<p>clienteEntrante igual al actual (misma IP)</p>");
			//webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");
			

		}



	}




}